Documents/ЗаявкаНаКонтрольКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаКонтрольКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаСклад</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтХранителя</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПриемкаТоваровНаХранение</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьРазблокировкуТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодтвержденияКачества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтролируемаяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КачествоПодтверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СкладскиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СкладскиеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратМатериаловИзПроизводстваОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНеПринятыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвижениеВФинансовомУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукцииВПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборИзЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВРозницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКомплектовДляРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКомплектующихДляСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаНаВнутренниеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПоВозвратуПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПоПеремещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеИзлишков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПоПеремещениюВПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеНедостач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеПорчи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеРезультатовПересчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуПомещениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводствоПриемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомплектующихПослеРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратМатериаловИзПроизводстваПриемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоВозвратуОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоПеремещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоПрочемуОприходованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПоПеремещениюВПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаСобранныхКомплектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеВЯчейки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНеПринятыхТоваровУстарел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПотреблениеМатериаловПриПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеМатериаловНаЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаПродукцииДляГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеСЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеСВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТМЦВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеТМЦИзЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеТМЦВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеСЗЕРНО</Name>
					<Comment>Серии, попавшие в документы интеграции с ФГИС "Зерно"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимодействиеССАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтПродукции</Name>
					<Comment>Указание серий при ремонте продукции</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Назначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Назначения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвиженияПоСкладскимРегистрам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьТолькоНаличие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСтавкиНДС</Name>
					<Comment>Формировать отчеты о закупках под принципала по ставкам НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаявкаНаКонтрольКачестваТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
// 
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("Обеспечение");
	МеханизмыДокумента.Добавить("РеестрДокументов");
	МеханизмыДокумента.Добавить("АдресныйСклад");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументОбъект.ЗаявкаНаКонтрольКачестваТоваров, ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаКонтрольКачестваТоваров") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений();
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры);
	ОтразитьПоПодсистемеСклад(Запрос, ТекстыЗапроса, Регистры);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти


#Область Прочее

// Возвращает Организацию, исходя из контролируемой партии документа.
// Параметры:
//  Объект - ДокументОбъект.ЗаявкаНаКонтрольКачестваТоваров - документ
// Возвращаемое значение:
//  СправочникСсылка.Организации - Организация.
Функция ОрганизацияИзКонтролируемойПартии(Объект) Экспорт
	
	Организация = Справочники.Организации.ПустаяСсылка();
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(ВсеКонтролируемыеПартии.Организация) КАК Организация
		|ИЗ
		|	Справочник.КонтролируемыеПартии КАК ВсеКонтролируемыеПартии
		|ГДЕ
		|	ВсеКонтролируемыеПартии.Ссылка В(&Ссылки)
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ВсеКонтролируемыеПартии.Организация) = МАКСИМУМ(ВсеКонтролируемыеПартии.Организация)";
	Запрос.УстановитьПараметр("Ссылки",
		Объект.Товары.Выгрузить(, "КонтролируемаяПартия").ВыгрузитьКолонку("КонтролируемаяПартия"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
	КонецЕсли;
	Возврат Организация;
	
КонецФункции

// Добавляет команду создания документа "Заявка на контроль качества товаров".
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
// Возвращаемое значение:
//  Неопределено -
//  СтрокаТаблицыЗначений -
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаявкаНаКонтрольКачестваТоваров) Тогда
		КомандаСоздатьНаОсновании = СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(
			КомандыСозданияНаОсновании, Метаданные.Документы.ЗаявкаНаКонтрольКачестваТоваров);
			КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьКонтрольКачестваТоваров";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

// Параметры документа для механизма заполнения реквизита КонтролируемаяПартия в документе.
// 
// Параметры:
//  ОбъектИлиСсылка - ДокументОбъект.ЗаявкаНаКонтрольКачестваТоваров, ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров - документ.
//  ИмяПоляКонтролируемаяПартия - Строка - имя поля, контролируемая партия.
// 
// Возвращаемое значение:
//  см. КонтрольКачества.НовыйРеквизитыКонтролируемойПартии
Функция РеквизитыКонтролируемойПартии(ОбъектИлиСсылка, ИмяПоляКонтролируемаяПартия) Экспорт
	
	Запрос = Новый Запрос();
	Ссылка = Неопределено;
	
	ИменаРеквизитовДокумента = "ПричинаБлокировкиТовара,Дата,Номер,ПланироватьРазблокировкуТоваров,ДатаПодтвержденияКачества,Организация";
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ОбъектИлиСсылка)) Тогда
		
		Ссылка = ОбъектИлиСсылка;
		Запрос.УстановитьПараметр("Ссылка", ОбъектИлиСсылка);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(ВсеПартии.Партнер) КАК Партнер,
			|	МАКСИМУМ(ВсеПартии.Договор) КАК Договор,
			|	МАКСИМУМ(ВсеПартии.Контрагент) КАК Контрагент,
			|	МАКСИМУМ(ВсеПартии.НаправлениеДеятельности) КАК НаправлениеДеятельности,
			|	МАКСИМУМ(ВсеПартии.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
			|	МАКСИМУМ(ВсеПартии.Подразделение) КАК Подразделение,
			|	МАКСИМУМ(ВсеПартии.Отправитель) КАК Отправитель,
			|	МАКСИМУМ(ВсеПартии.Партнер) = МИНИМУМ(ВсеПартии.Партнер) КАК ОдинПартнер,
			|	МАКСИМУМ(ВсеПартии.Договор) = МИНИМУМ(ВсеПартии.Договор) КАК ОдинДоговор,
			|	МАКСИМУМ(ВсеПартии.Контрагент) = МИНИМУМ(ВсеПартии.Контрагент) КАК ОдинКонтрагент,
			|	МАКСИМУМ(ВсеПартии.НаправлениеДеятельности) = МИНИМУМ(ВсеПартии.НаправлениеДеятельности) КАК ОдноНаправлениеДеятельности,
			|	МАКСИМУМ(ВсеПартии.ХозяйственнаяОперация) = МИНИМУМ(ВсеПартии.ХозяйственнаяОперация) КАК ОднаХозяйственнаяОперация,
			|	МАКСИМУМ(ВсеПартии.Отправитель) = МИНИМУМ(ВсеПартии.Отправитель) КАК ОдинОтправитель,
			|	МАКСИМУМ(ВсеПартии.Подразделение) = МИНИМУМ(ВсеПартии.Подразделение) КАК ОдноПодразделение
			|ИЗ
			|	Документ.ЗаявкаНаКонтрольКачестваТоваров.Товары КАК Товары
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтролируемыеПартии КАК ВсеПартии
			|		ПО ВсеПартии.Ссылка = Товары.КонтролируемаяПартия
			|ГДЕ
			|	Товары.Ссылка = &Ссылка";
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитовДокумента);
			
	Иначе
		
		Ссылка = ОбъектИлиСсылка.Ссылка;
		Товары = ОбъектИлиСсылка.Товары;
		Ссылки = Товары.Выгрузить(, "КонтролируемаяПартия").ВыгрузитьКолонку("КонтролируемаяПартия");
		Запрос.УстановитьПараметр("Ссылки", Ссылки);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(ВсеПартии.Партнер) КАК Партнер,
			|	МАКСИМУМ(ВсеПартии.Договор) КАК Договор,
			|	МАКСИМУМ(ВсеПартии.Контрагент) КАК Контрагент,
			|	МАКСИМУМ(ВсеПартии.НаправлениеДеятельности) КАК НаправлениеДеятельности,
			|	МАКСИМУМ(ВсеПартии.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
			|	МАКСИМУМ(ВсеПартии.Подразделение) КАК Подразделение,
			|	МАКСИМУМ(ВсеПартии.Отправитель) КАК Отправитель,
			|	МАКСИМУМ(ВсеПартии.Партнер) = МИНИМУМ(ВсеПартии.Партнер) КАК ОдинПартнер,
			|	МАКСИМУМ(ВсеПартии.Договор) = МИНИМУМ(ВсеПартии.Договор) КАК ОдинДоговор,
			|	МАКСИМУМ(ВсеПартии.Контрагент) = МИНИМУМ(ВсеПартии.Контрагент) КАК ОдинКонтрагент,
			|	МАКСИМУМ(ВсеПартии.НаправлениеДеятельности) = МИНИМУМ(ВсеПартии.НаправлениеДеятельности) КАК ОдноНаправлениеДеятельности,
			|	МАКСИМУМ(ВсеПартии.ХозяйственнаяОперация) = МИНИМУМ(ВсеПартии.ХозяйственнаяОперация) КАК ОднаХозяйственнаяОперация,
			|	МАКСИМУМ(ВсеПартии.Отправитель) = МИНИМУМ(ВсеПартии.Отправитель) КАК ОдинОтправитель,
			|	МАКСИМУМ(ВсеПартии.Подразделение) = МИНИМУМ(ВсеПартии.Подразделение) КАК ОдноПодразделение
			|ИЗ
			|	Справочник.КонтролируемыеПартии КАК ВсеПартии
			|ГДЕ
			|	ВсеПартии.Ссылка В(&Ссылки)";
			
		РеквизитыДокумента = Новый Структура(ИменаРеквизитовДокумента);
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ОбъектИлиСсылка);
			
	КонецЕсли;
	
	Реквизиты = КонтрольКачества.НовыйРеквизитыКонтролируемойПартии();
	Реквизиты.Партия = Ссылка;
	Реквизиты.ПричинаБлокировкиТовара = РеквизитыДокумента.ПричинаБлокировкиТовара;
	Реквизиты.ПланироватьРазблокировкуТовара = РеквизитыДокумента.ПланироватьРазблокировкуТоваров;
	Реквизиты.НомерДокументаПоступления = РеквизитыДокумента.Номер;
	Реквизиты.ДатаДокументаПоступления = РеквизитыДокумента.Дата;
	Реквизиты.ДатаПодтвержденияКачества = РеквизитыДокумента.ДатаПодтвержденияКачества;
	Реквизиты.Организация = РеквизитыДокумента.Организация;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.ОдинПартнер <> Null Тогда
		Если Выборка.ОдинПартнер Тогда
			Реквизиты.Партнер = Выборка.Партнер;
		КонецЕсли;
		Если Выборка.ОдинДоговор Тогда
			Реквизиты.Договор = Выборка.Договор;
		КонецЕсли;
		Если Выборка.ОдинКонтрагент Тогда
			Реквизиты.Контрагент = Выборка.Контрагент;
		КонецЕсли;
		Если Выборка.ОдноНаправлениеДеятельности Тогда
			Реквизиты.НаправлениеДеятельности = Выборка.НаправлениеДеятельности;
		КонецЕсли;
		Если Выборка.ОднаХозяйственнаяОперация Тогда
			Реквизиты.ХозяйственнаяОперация = Выборка.ХозяйственнаяОперация;
		КонецЕсли;
		Если Выборка.ОдинОтправитель Тогда
			Реквизиты.Отправитель = Выборка.Отправитель;
		КонецЕсли;
		Если Выборка.ОдноПодразделение Тогда
			Реквизиты.Подразделение = Выборка.Подразделение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаСписка" Тогда
		СтандартнаяОбработка = Ложь;
		ИсследованиеТоваровВключены = ИсследованияТоваровВключены();
		Если ИсследованиеТоваровВключены Тогда
			ВыбраннаяФорма = "ВыполнениеЗаявокНаИсследования";
		Иначе
			ВыбраннаяФорма = "ФормаСписка";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
// Параметры:
//  Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.Списки
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ЗначениеРазрешено(Склад, ПустаяСсылка КАК Истина)";

КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Комплект документов на принтер
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявкаНаКонтрольКачестваТоваров";
	КомандаПечати.Представление = НСтр("ru = 'Заявка на контроль качества товаров'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаНаКонтрольКачестваТоваров") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявкаНаКонтрольКачестваТоваров",
			НСтр("ru = 'Заявка на контроль качества товаров'"),
			СформироватьПечатнуюФормуЗаявкаНаКонтрольКачестваТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
			,
			"Документ.ЗаявкаНаКонтрольКачестваТоваров.ПФ_MXL_ЗаявкаНаКонтрольКачестваТоваров");
	КонецЕсли;
	
КонецПроцедуры

// Определяет список команд создания на основании.
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИсследованиеТоваровВключены = ИсследованияТоваровВключены();
	Если Не ИсследованиеТоваровВключены Тогда
		Документы.АктКонтроляКачестваТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВстраиваемыеМеханизмы

// Имена реквизитов, от значений которых зависят параметры указания серий
//
//	Возвращаемое значение:
//		Строка - имена реквизитов, перечисленные через запятую.
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	
	ИменаРеквизитов = "Дата";
	Возврат ИменаРеквизитов;
	
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//  Объект	 - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
//
// Возвращаемое значение:
//  см. НоменклатураКлиентСервер.ПараметрыУказанияСерий.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаявкаНаКонтрольКачестваТоваров";
	ПараметрыУказанияСерий.ИмяТЧСерии = "Товары";
	ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПустаяСсылка());
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад");
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад");
	ПараметрыУказанияСерий.ИменаПолейДополнительные.Добавить("Склад");
	ПараметрыУказанияСерий.ИменаПолейДополнительные.Добавить("Помещение");
	ПараметрыУказанияСерий.ИменаПолейДополнительные.Добавить("Назначение");
	ПараметрыУказанияСерий.ЭтоНакладная = Истина;
	ПараметрыУказанияСерий.ИмяПоляКонтролируемаяПартия = ".КонтролируемаяПартия";
	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	Возврат ПараметрыУказанияСерий;
	
КонецФункции

// Возвращает текст запроса для расчета статусов указания серий
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Серия КАК Серия,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.Серия КАК Серия,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ ТоварыДляЗапроса
	|ИЗ
	|	Товары КАК Товары
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад, ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтарыйСтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
	|					ТОГДА ВЫБОР
	|							КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|								ТОГДА ВЫБОР
	|										КОГДА Товары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|											ТОГДА 13
	|										ИНАЧЕ 14
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|										ТОГДА 9
	|									ИНАЧЕ 10
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтбора
	|					ТОГДА ВЫБОР
	|							КОГДА Товары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|								ТОГДА 7
	|							ИНАЧЕ 8
	|						КОНЕЦ
	|				КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПоФактуОтбора
	|						И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|					ТОГДА ВЫБОР
	|							КОГДА Товары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|								ТОГДА 3
	|							ИНАЧЕ 4
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ ТаблицаСтатусов
	|ИЗ
	|	ТоварыДляЗапроса КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|			ПО ПолитикиУчетаСерий.Склад = Склады.Ссылка
	|		ПО Товары.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка
	|			И ПолитикиУчетаСерий.Склад = Товары.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтатусов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСтатусов.СтатусУказанияСерий КАК СтатусУказанияСерий
	|ИЗ
	|	ТаблицаСтатусов КАК ТаблицаСтатусов
	|ГДЕ
	|	ТаблицаСтатусов.СтарыйСтатусУказанияСерий <> ТаблицаСтатусов.СтатусУказанияСерий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;

КонецФункции

// Инициализирует параметры, обслуживающие выбор назначений в формах документа.
//
//  Возвращаемое значение:
//  См. Справочники.Назначения.МакетФормыВыбораНазначений
//
Функция МакетФормыВыбораНазначений() Экспорт
	
	МакетФормы = Справочники.Назначения.МакетФормыВыбораНазначений();
	
	Справочники.Назначения.ДобавитьШаблонНазначений(МакетФормы);
	
	// Остатки товаров на складе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(
		МакетФормы,
		"ОбеспечениеЗаказов",
		Истина, "Объект.Товары.Назначение");
	
	ОписаниеКолонок.Колонки.НайтиПоЗначению("ВНаличии").Пометка = Истина;
	ОписаниеКолонок.КолонкиПоУмолчанию.Добавить("ВНаличии");
	
	ОписаниеКолонок.ПутиКДанным.Номенклатура = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика = "Объект.Товары.Характеристика";
	ОписаниеКолонок.ПутиКДанным.Склад = "Объект.Склад";
	ОписаниеКолонок.ПутиКДанным.КонтролируемаяПартия = "Объект.Товары.КонтролируемаяПартия";
	
	Возврат МакетФормы;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ПолноеИмяОбъекта()
	
	Возврат "Документ.ЗаявкаНаКонтрольКачестваТоваров";
	
КонецФункции

Процедура ПолучитьДанныеДокумента(Запрос, ДокументСсылка)
	
	СписокЗапросов = Новый Массив();
	
	ТекстЗапросаДанныеДокументаШапка(СписокЗапросов);
	ТекстЗапросаДанныеДокументаТаблицаТовары(СписокЗапросов);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДокумента.Номер КАК Номер
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Запрос.УстановитьПараметр("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	Возврат;
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаШапка(СписокЗапросов)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеШапки.ВерсияДанных КАК ВерсияДанных,
		|	ДанныеШапки.Дата КАК Дата,
		|	ДанныеШапки.МоментВремени КАК МоментВремени,
		|	ДанныеШапки.Номер КАК Номер,
		|	ДанныеШапки.ПометкаУдаления КАК ПометкаУдаления,
		|	ДанныеШапки.Проведен КАК Проведен,
		|	ДанныеШапки.Ссылка КАК Ссылка,
		|	ДанныеШапки.ПричинаБлокировкиТовара КАК ПричинаБлокировкиТовара,
		|	ДанныеШапки.ПланироватьРазблокировкуТоваров КАК ПланироватьРазблокировкуТоваров,
		|	ДанныеШапки.ДатаПодтвержденияКачества КАК ДатаПодтвержденияКачества,
		|	ДанныеШапки.Подразделение КАК Подразделение,
		|	ДанныеШапки.Ответственный КАК Ответственный,
		|	ДанныеШапки.Автор КАК Автор,
		|	ДанныеШапки.Склад КАК Склад,
		|	ДанныеШапки.Организация КАК Организация,
		|	ДанныеШапки.Комментарий КАК Комментарий,
		|	ДанныеШапки.КонтролируемаяПартия КАК КонтролируемаяПартия
		|ПОМЕСТИТЬ ДанныеДокументаШапка
		|ИЗ
		|	Документ.ЗаявкаНаКонтрольКачестваТоваров КАК ДанныеШапки
		|ГДЕ
		|	ДанныеШапки.Ссылка = &Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаТаблицаТовары(СписокЗапросов)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.КонтролируемаяПартия КАК КонтролируемаяПартия,
		|	Товары.Серия КАК Серия,
		|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	Товары.Склад КАК Склад,
		|	Товары.Помещение КАК Помещение,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.Ячейка КАК Ячейка,
		|	Товары.Количество КАК Количество,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Товары.КачествоПодтверждено КАК КачествоПодтверждено,
		|	Товары.Склад.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач КАК СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		|	Товары.Склад.ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач КАК СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач
		|ПОМЕСТИТЬ ДанныеДокументаТаблицаТовары
		|ИЗ
		|	Документ.ЗаявкаНаКонтрольКачестваТоваров.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ТекстЗапросаДанныеДокументаТаблицаТоварыСводно(Запрос, ТекстыЗапроса, ПакетныйРежим = Ложь)
	
	ИмяТаблицы = "ДанныеДокументаТаблицаТоварыСводно";
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
		|				ЕСТЬNULL(
		|					ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) = 1
		|			ТОГДА
		|				МАКСИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК НаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
		|				ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).Партнер,
		|					ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))) = 1
		|			ТОГДА
		|				МАКСИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).Партнер,
		|					ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	КОНЕЦ КАК Партнер,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
		|				ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).Договор,
		|					ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))) = 1
		|			ТОГДА
		|				МАКСИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).Договор,
		|					ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ КАК Договор,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
		|				ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).Контрагент,
		|					ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) = 1
		|			ТОГДА
		|				МАКСИМУМ(ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаТовары.КонтролируемаяПартия КАК Справочник.КонтролируемыеПартии).Контрагент,
		|					ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент
		|ПОМЕСТИТЬ ДанныеДокументаТаблицаТоварыСводно
		|ИЗ
		|	ДанныеДокументаТаблицаТовары КАК ТаблицаТовары
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТовары.Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	
	Если ПакетныйРежим Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ПОМЕСТИТЬ ДанныеДокументаТаблицаТоварыСводно",
			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ИНДЕКСИРОВАТЬ ПО
			|	Ссылка",
			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ДанныеДокументаТаблицаТовары",
			"Документ.ЗаявкаНаКонтрольКачестваТоваров.Товары");
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста(Запрос, ТекстыЗапроса)
	
	ИмяТаблицы = "ДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста";
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.КонтролируемаяПартия КАК КонтролируемаяПартия,
		|	Товары.Серия КАК Серия,
		|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	Товары.Склад КАК Склад,
		|	Товары.Помещение КАК Помещение,
		|	Товары.КачествоПодтверждено КАК КачествоПодтверждено,
		|	Товары.СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач КАК СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		|	Товары.СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач КАК СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста
		|ИЗ
		|	ДанныеДокументаТаблицаТовары КАК Товары
		|ГДЕ
		|	ЕСТЬNULL(ВЫРАЗИТЬ(Товары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения).ТипУпаковки,
		|		НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Комплектующие.Ссылка КАК Ссылка,
		|	Комплектующие.Номенклатура КАК Номенклатура,
		|	Комплектующие.Характеристика КАК Характеристика,
		|	Комплектующие.Назначение КАК Назначение,
		|	Комплектующие.КонтролируемаяПартия КАК КонтролируемаяПартия,
		|	Комплектующие.Серия КАК Серия,
		|	Комплектующие.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	Комплектующие.Склад КАК Склад,
		|	Комплектующие.Помещение КАК Помещение,
		|	Комплектующие.КачествоПодтверждено КАК КачествоПодтверждено,
		|	Комплектующие.СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач КАК СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		|	Комплектующие.СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач КАК СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач,
		|	МИНИМУМ(Комплектующие.Количество) КАК Количество
		|ИЗ(
		|	ВЫБРАТЬ
		|		Товары.Ссылка КАК Ссылка,
		|		Товары.Номенклатура КАК Номенклатура,
		|		Товары.Характеристика КАК Характеристика,
		|		Товары.Назначение КАК Назначение,
		|		Товары.КонтролируемаяПартия КАК КонтролируемаяПартия,
		|		Товары.Серия КАК Серия,
		|		Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|		Товары.Склад КАК Склад,
		|		Товары.Помещение КАК Помещение,
		|		Товары.Упаковка КАК Упаковка,
		|		Товары.КачествоПодтверждено КАК КачествоПодтверждено,
		|		Товары.СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач КАК СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		|		Товары.СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач КАК СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач,
		|		СУММА(Товары.Количество) КАК Количество
		|ИЗ
		|	ДанныеДокументаТаблицаТовары КАК Товары
		|ГДЕ
		|	ВЫРАЗИТЬ(Товары.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения).ТипУпаковки
		|		= ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
		|	СГРУППИРОВАТЬ ПО
		|		Товары.Ссылка,
		|		Товары.Номенклатура,
		|		Товары.Характеристика,
		|		Товары.Назначение,
		|		Товары.КонтролируемаяПартия,
		|		Товары.Серия,
		|		Товары.СтатусУказанияСерий,
		|		Товары.Склад,
		|		Товары.Помещение,
		|		Товары.Упаковка,
		|		Товары.КачествоПодтверждено,
		|		Товары.СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		|		Товары.СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач) КАК Комплектующие
		|	СГРУППИРОВАТЬ ПО
		|		Комплектующие.Ссылка,
		|		Комплектующие.Номенклатура,
		|		Комплектующие.Характеристика,
		|		Комплектующие.Назначение,
		|		Комплектующие.КонтролируемаяПартия,
		|		Комплектующие.Серия,
		|		Комплектующие.СтатусУказанияСерий,
		|		Комплектующие.Склад,
		|		Комплектующие.Помещение,
		|		Комплектующие.КачествоПодтверждено,
		|		Комплектующие.СкладИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач,
		|		Комплектующие.СкладДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры, ПакетныйРежим = Ложь)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК ДатаДокументаИБ,
		|	ДанныеДокумента.Номер КАК НомерДокументаИБ,
		|	&ИдентификаторМетаданных КАК ТипСсылки,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонтрольКачестваТоваров) КАК ХозяйственнаяОперация,
		|	ТаблицаТоварыСводно.Партнер КАК Партнер,
		|	ТаблицаТоварыСводно.Контрагент КАК Контрагент,
		|	ТаблицаТоварыСводно.Договор КАК Договор,
		|	ТаблицаТоварыСводно.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДанныеДокумента.Склад КАК МестоХранения,
		|	ДанныеДокумента.Подразделение КАК Подразделение,
		|	ДанныеДокумента.Ответственный КАК Ответственный,
		|	ДанныеДокумента.Автор КАК Автор,
		|	ДанныеДокумента.Комментарий КАК Комментарий,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	0 КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК Статус,
		|	ДанныеДокумента.Проведен КАК Проведен,
		|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ДополнительнаяЗапись,
		|	"""" КАК Дополнительно,
		|	ДанныеДокумента.Дата КАК ДатаПервичногоДокумента,
		|	"""" КАК НаименованиеПервичногоДокумента,
		|	&НомерНаПечать КАК НомерПервичногоДокумента,
		|	ДанныеДокумента.Дата КАК ДатаОтраженияВУчете,
		|	НЕОПРЕДЕЛЕНО КАК Приоритет
		|ИЗ
		|	ДанныеДокументаШапка КАК ДанныеДокумента
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаТоварыСводно КАК ТаблицаТоварыСводно
		|		ПО ТаблицаТоварыСводно.Ссылка = ДанныеДокумента.Ссылка";
	
	Если ПакетныйРежим Тогда
		
		ТекстСводно = ТекстЗапросаДанныеДокументаТаблицаТоварыСводно(Неопределено, Неопределено, Истина);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомерНаПечать", "ДанныеДокумента.Номер");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокумента.Комментарий", "ВЫРАЗИТЬ(ДанныеДокумента.Комментарий КАК Строка (100))");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаШапка", "Документ.ЗаявкаНаКонтрольКачестваТоваров");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаТаблицаТоварыСводно", СтрШаблон("(%1)", ТекстСводно));
		Возврат ТекстЗапроса;
		
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ДанныеДокументаТаблицаТоварыСводно", ТекстыЗапроса) Тогда
		ТекстЗапросаДанныеДокументаТаблицаТоварыСводно(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияСерийТоваров";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Серия КАК Серия,
		|	Товары.Количество КАК Количество,
		|	Товары.Склад КАК Отправитель,
		|	Товары.Помещение КАК ПомещениеОтправителя,
		|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтражениеНедостач) КАК СкладскаяОперация,
		|	Товары.Ссылка КАК Документ,
		|	Реквизиты.Дата КАК Период
		|ИЗ
		|	ДанныеДокументаТаблицаТовары КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК Реквизиты
		|		ПО Реквизиты.Ссылка = Товары.Ссылка
		|ГДЕ
		|	Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры)
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста", ТекстыЗапроса) Тогда
		ТекстЗапросаДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Реквизиты.Дата КАК Период,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад КАК Склад,
		|	Товары.Назначение КАК Назначение,
		|	Товары.КонтролируемаяПартия КАК КонтролируемаяПартия,
		|	Товары.Количество КАК Количество,
		|	НЕОПРЕДЕЛЕНО КАК ЗапланированныйРасходРаспределенногоЗапаса,
		|	ИСТИНА КАК КонтрольСвободногоОстатка
		|ИЗ
		|	ДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК Реквизиты
		|		ПО Реквизиты.Ссылка = Товары.Ссылка";
		
	РаспределениеЗапасовДвижения.РасходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть, Истина);
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Реквизиты.Дата КАК Период,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад КАК Склад,
		|	Товары.Назначение КАК Назначение,
		|	ВЫБОР
		|		КОГДА Товары.КачествоПодтверждено
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
		|		ИНАЧЕ Реквизиты.КонтролируемаяПартия
		|	КОНЕЦ КАК КонтролируемаяПартия,
		|	НЕ Товары.КачествоПодтверждено КАК ПроконтролироватьКачество,
		|	Реквизиты.ПланироватьРазблокировкуТоваров КАК ПодлежитРазблокировке,
		|	Реквизиты.ДатаПодтвержденияКачества КАК ДатаПодтвержденияКачества,
		|	Товары.Количество КАК Количество,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике
		|ИЗ
		|	ДанныеДокументаТаблицаТоварыСвернутьТоварныеМеста КАК Товары
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК Реквизиты
		|		ПО Реквизиты.Ссылка = Товары.Ссылка";
	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть, Ложь, Истина);
	
КонецПроцедуры

Процедура ОтразитьПоПодсистемеСклад(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыНаСкладах";
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		
		ТекстЗапросаДокумента =
			"ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка,
			|	Шапка.Дата КАК Период,
			|	НЕОПРЕДЕЛЕНО КАК Заказ,
			|	НЕОПРЕДЕЛЕНО КАК ЗаданиеНаПеревозку,
			|	НЕОПРЕДЕЛЕНО КАК Получатель,
			|	Товары.Склад КАК Склад,
			|	Товары.Ячейка КАК Ячейка,
			|	Товары.Помещение КАК Помещение,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Назначение КАК Назначение,
			|	Товары.КонтролируемаяПартия КАК КонтролируемаяПартия,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Серия КАК Серия,
			|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	Товары.Количество КАК Количество,
			|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить) КАК Действие,
			|	ЛОЖЬ КАК КСборке,
			|	ЛОЖЬ КАК Собирается,
			|	ЛОЖЬ КАК Собрано,
			|	ИСТИНА КАК КОтгрузке
			|ИЗ
			|	ДанныеДокументаШапка КАК Шапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаТовары КАК Товары
			|		ПО Шапка.Ссылка = Товары.Ссылка";
			
		СкладыСервер.ОтгрузитьТоварСоСклада(Запрос, ТекстыЗапроса, ИмяРегистра, ТекстЗапросаДокумента, Истина);
		
	КонецЕсли;
	
	ИмяРегистра = "ТоварыВЯчейках";
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		
		ТекстЗапросаДокумента =
			"ВЫБРАТЬ
			|	Товары.Ссылка КАК Ссылка,
			|	Шапка.Дата КАК Дата,
			|	Товары.Склад КАК Склад,
			|	Товары.Ячейка КАК Ячейка,
			|	Товары.Помещение КАК Помещение,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Назначение КАК Назначение,
			|	Товары.КонтролируемаяПартия КАК КонтролируемаяПартия,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Серия КАК Серия,
			|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	-Товары.Количество КАК Количество,
			|	-Товары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ИСТИНА КАК ИзменяетсяОстаток
			|ИЗ
			|	ДанныеДокументаШапка КАК Шапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаТовары КАК Товары
			|		ПО Шапка.Ссылка = Товары.Ссылка";
		СкладыСервер.ЗарегистрироватьИзлишкиНедостачиНаСкладе(Запрос, ТекстыЗапроса, ИмяРегистра, ТекстЗапросаДокумента);
		
	КонецЕсли;
	
	// Оприходование товаров с новой партией.
	ТекстЗапросаДокумента =
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Шапка.Дата КАК Дата,
		|	Товары.Склад КАК Склад,
		|	Товары.Ячейка КАК Ячейка,
		|	Товары.Помещение КАК Помещение,
		|	НЕОПРЕДЕЛЕНО КАК Отправитель,
		|	НЕОПРЕДЕЛЕНО КАК Распоряжение,
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Упаковка КАК Упаковка,
		|	ЛОЖЬ КАК ЭтоУпаковочныйЛист,
		|	Товары.Серия КАК Серия,
		|	ИСТИНА КАК ПроконтролироватьКачество,
		// не важно, так как нет движений по Товары к поступлению.
		|	ЛОЖЬ КАК ДвижениеРанееПоступившейПартии,
		|	ВЫБОР
		|		КОГДА Товары.КачествоПодтверждено
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
		|		ИНАЧЕ Шапка.КонтролируемаяПартия
		|	КОНЕЦ КАК КонтролируемаяПартия,
		|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	Товары.Количество КАК Количество,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЛОЖЬ КАК Принимается,
		|	ИСТИНА КАК Принят,
		|	ИСТИНА КАК ЭтоПриемкаБезРаспоряжения
		|ИЗ
		|	ДанныеДокументаШапка КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаТаблицаТовары КАК Товары
		|		ПО Шапка.Ссылка = Товары.Ссылка";
		
	СкладыСервер.ПринятьТоварНаСклад(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаДокумента, "Товары");
	
КонецПроцедуры


Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт
	
	ПолноеИмяДокумента = "Документ.ЗаявкаНаКонтрольКачестваТоваров";
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("ИдентификаторМетаданных",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяДокумента));
	
	Если ИмяРегистра <> "РеестрДокументов" Тогда
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Неопределено, Неопределено, "РеестрДокументов", Истина);
		
	КонецЕсли;
	
	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ИсследованияТоваровВключены()
	
	ИспользоватьИсследования = Ложь;
	Возврат ИспользоватьИсследования;
	
КонецФункции

Функция СформироватьПечатнуюФормуЗаявкаНаКонтрольКачестваТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МетаданныеДокумента = Документы.ЗаявкаНаКонтрольКачестваТоваров.ПустаяСсылка().Метаданные();
	Если Не ЗначениеЗаполнено(МетаданныеДокумента.ПредставлениеОбъекта) Тогда
		СинонимДокумента = МетаданныеДокумента.Синоним;
	Иначе
		СинонимДокумента = МетаданныеДокумента.ПредставлениеОбъекта;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаКонтрольКачестваТоваров_ПечатнаяФормаДокумента";
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяКолонкиКодов = КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(ИмяКолонкиКодов);
	ВыводитьСерии = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	
	Запрос = Новый Запрос();
	Текст =
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(Товары.Склад) = МАКСИМУМ(Товары.Склад)
		|			ТОГДА МИНИМУМ(Товары.Склад)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(Товары.Помещение) = МАКСИМУМ(Товары.Помещение)
		|			ТОГДА МИНИМУМ(Товары.Помещение)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
		|	КОНЕЦ КАК Помещение,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(Товары.КонтролируемаяПартия.Партия) = МАКСИМУМ(Товары.КонтролируемаяПартия.Партия)
		|			ТОГДА МИНИМУМ(Товары.КонтролируемаяПартия.Партия) 
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Партия
		|ПОМЕСТИТЬ ТоварыСводно
		|ИЗ
		|	Документ.ЗаявкаНаКонтрольКачестваТоваров.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка В(&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|/////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шапка.Ссылка КАК Ссылка,
		|	Шапка.Дата КАК Дата,
		|	Шапка.Номер КАК Номер,
		|	ПРЕДСТАВЛЕНИЕ(Шапка.Организация) КАК ОрганизацияПредставление,
		|	Шапка.Ответственный.ФизическоеЛицо КАК Ответственный,
		|	ТоварыСводно.Склад КАК Склад,
		|	ТоварыСводно.Помещение КАК Помещение,
		|	ТоварыСводно.Партия КАК Партия,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыСводно.Склад) КАК СкладПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыСводно.Помещение) КАК ПомещениеПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыСводно.Партия) КАК ПартияПредставление
		|ИЗ
		|	Документ.ЗаявкаНаКонтрольКачестваТоваров КАК Шапка
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСводно КАК ТоварыСводно
		|		ПО ТоварыСводно.Ссылка = Шапка.Ссылка
		|ГДЕ
		|	Шапка.Ссылка В(&МассивОбъектов)
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|;
		|
		|/////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	Товары.КачествоПодтверждено КАК КачествоПодтверждено,
		|	Товары.Упаковка КАК Упаковка,
		|	СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ТоварыСгруппированные
		|ИЗ
		|	Документ.ЗаявкаНаКонтрольКачестваТоваров.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка В(&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка,
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Серия,
		|	Товары.Упаковка,
		|	Товары.КачествоПодтверждено
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|//////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	&ВыводитьКоды КАК Артикул,
		|	Товары.Номенклатура.НаименованиеПолное КАК ПредставлениеНоменклатуры,
		|	Товары.Характеристика.НаименованиеПолное КАК ПредставлениеХарактеристики,
		|	Товары.Серия.Наименование КАК ПредставлениеСерии,
		|	ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
		|	ВЫБОР
		|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(Товары.Номенклатура.ЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Товары.Упаковка)
		|	КОНЕЦ КАК ПредставлениеЕдиницыИзмеренияУпаковки,
		|	Товары.КачествоПодтверждено КАК КачествоПодтверждено
		|ИЗ
		|	ТоварыСгруппированные КАК Товары
		|ГДЕ
		|	Товары.Ссылка В(&МассивОбъектов)
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка, НомерСтроки
		|ИТОГИ ПО
		|	Ссылка";
	
	ПодстановкаВыводитьКоды = ?(ВыводитьКоды, "Товары.Номенклатура." + ИмяКолонкиКодов, """""");
	Текст = СтрЗаменить(Текст, "&ВыводитьКоды", ПодстановкаВыводитьКоды);
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результаты = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПоДокументам = Результаты[1].Выбрать();
	ВыборкаПоТабличнымЧастям = Результаты[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	РеквизитыДокумента = Новый Структура("Номер,Дата,Префикс");
	
	ДопПараметрыПредставлениеНоменклатуры = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
	ДопПараметрыПредставлениеНоменклатуры.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если Не ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьСклад = ЗначениеЗаполнено(ВыборкаПоДокументам.Склад);
		ЕстьПартия = ЗначениеЗаполнено(ВыборкаПоДокументам.Партия);
		
		// Макет получаем в цикле,т.к. ширина колонок зависит от склада и помещения в документе.
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаКонтрольКачестваТоваров.ПФ_MXL_ЗаявкаНаКонтрольКачестваТоваров");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодписей = Макет.ПолучитьОбласть("Подписи");
		
		Если ЕстьСклад И ЕстьПартия Тогда
			ИмяОбластиШапка = "ШапкаИСкладИПартия";
		ИначеЕсли ЕстьСклад И Не ЕстьПартия Тогда
			ИмяОбластиШапка = "ШапкаИСклад";
		ИначеЕсли ЕстьПартия Тогда
			ИмяОбластиШапка = "ШапкаБезСкладаИПартия";
		Иначе
			ИмяОбластиШапка = "ШапкаБезСклада";
		КонецЕсли;
		ОбластьШапка = Макет.ПолучитьОбласть(ИмяОбластиШапка);
		
		ОбластьТаблицы = Новый Массив();
		
		Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
		Строка = Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
		Подвал = Макет.ПолучитьОбласть("ПодвалТаблицы|НачалоСтроки");
		
		ОбластьТаблицы.Добавить(Новый Структура("Шапка,Строка,Подвал", Шапка, Строка, Подвал));
		
		СкрытаяШирина = 0;
		
		Если ВыводитьКоды Тогда
			
			Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			Строка = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
			Подвал = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			
			ОбластьТаблицы.Добавить(Новый Структура("Шапка,Строка,Подвал", Шапка, Строка, Подвал));
			Шапка.Параметры.ИмяКолонкиКодов = ПредставлениеКолонкиКодов; 
			
		Иначе
			СкрытаяШирина = Макет.Область("КолонкаКодов").ШиринаКолонки;
		КонецЕсли;
		
		Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
		Строка = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
		Подвал = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
		
		ОбластьТаблицы.Добавить(Новый Структура("Шапка,Строка,Подвал", Шапка, Строка, Подвал));
		
		Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Количество");
		Строка = Макет.ПолучитьОбласть("СтрокаТаблицы|Количество");
		Подвал = Макет.ПолучитьОбласть("ПодвалТаблицы|Количество");
		
		ОбластьТаблицы.Добавить(Новый Структура("Шапка,Строка,Подвал", Шапка, Строка, Подвал));
		
		Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + СкрытаяШирина;
		СкрытаяШирина = 0;
		
		Шапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КачествоПодтверждено");
		Строка = Макет.ПолучитьОбласть("СтрокаТаблицы|КачествоПодтверждено");
		Подвал = Макет.ПолучитьОбласть("ПодвалТаблицы|КачествоПодтверждено");
		
		ОбластьТаблицы.Добавить(Новый Структура("Шапка,Строка,Подвал", Шапка, Строка, Подвал));
		
		ВсегоОбластейТаблицы = ОбластьТаблицы.Количество() - 1;
		
		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента,ВыборкаПоДокументам);
		
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, СинонимДокумента);
		СтруктураДанныхЗаголовка = Новый Структура();
		СтруктураДанныхЗаголовка.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураДанныхЗаголовка);
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
			ТабличныйДокумент, Макет, ОбластьЗаголовок, ВыборкаПоДокументам.Ссылка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоДокументам);
		
		Если ЕстьСклад Тогда
			
			ОбластьШапка.Параметры.СкладПредставление = СкладыСервер.ПолучитьПредставлениеСклада(
				ВыборкаПоДокументам.СкладПредставление,
				ВыборкаПоДокументам.ПомещениеПредставление);
				
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Для ИндексОбласти = 0 По ВсегоОбластейТаблицы Цикл
			ОписаниеОбласти = ОбластьТаблицы[ИндексОбласти]; // Структура
			ТекущаяОбласть = ОписаниеОбласти.Шапка; // ТабличныйДокумент
			Если ИндексОбласти = 0 Тогда
				ТабличныйДокумент.Вывести(ТекущаяОбласть);
			Иначе
				ТабличныйДокумент.Присоединить(ТекущаяОбласть);
			КонецЕсли;
		КонецЦикла;
		
		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
			
			Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаПоСтрокамТЧ.ПредставлениеНоменклатуры,
				ВыборкаПоСтрокамТЧ.ПредставлениеХарактеристики,
				, // Упаковка
				ВыборкаПоСтрокамТЧ.ПредставлениеСерии,
				ДопПараметрыПредставлениеНоменклатуры);
			СтруктураПараметров = Новый Структура("Товар", Товар);
			
			Для ИндексОбласти = 0 По ВсегоОбластейТаблицы Цикл
				ОписаниеОбласти = ОбластьТаблицы[ИндексОбласти]; // Структура
				ТекущаяОбласть = ОписаниеОбласти.Строка; // ТабличныйДокумент
				ТекущаяОбласть.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
				ТекущаяОбласть.Параметры.Заполнить(СтруктураПараметров);
				Если ИндексОбласти = 0 Тогда
					ТабличныйДокумент.Вывести(ТекущаяОбласть);
				Иначе
					ТабличныйДокумент.Присоединить(ТекущаяОбласть);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Для ИндексОбласти = 0 По ВсегоОбластейТаблицы Цикл
			ОписаниеОбласти = ОбластьТаблицы[ИндексОбласти]; // Структура
			ТекущаяОбласть = ОписаниеОбласти.Подвал; // ТабличныйДокумент
			Если ИндексОбласти = 0 Тогда
				ТабличныйДокумент.Вывести(ТекущаяОбласть);
			Иначе
				ТабличныйДокумент.Присоединить(ТекущаяОбласть);
			КонецЕсли;
		КонецЦикла;
		
		ОбластьПодписей.Параметры.Ответственный = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(
			ВыборкаПоДокументам.Ответственный, ВыборкаПоДокументам.Дата);
		ТабличныйДокумент.Вывести(ОбластьПодписей);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
